import React, { useState, useEffect } from "react";
import CustomNavBar from "./../component/CustomNavBar";
import { Card, WingBlank, WhiteSpace, Button } from "antd-mobile";
import { useHistory } from "react-router-dom";
import CustomIcon from "./../component/CustomIcon";

export default function Result() {
  const history = useHistory();

  function goHome() {
    history.push("/");
    localStorage.clear();
  }

  const [disease, setDisease] = useState("");
  useEffect(() => {
    const data = [
      {
        disease: "pityriasis_versicolor",
        nameEN: "Pityriasis versicolor",
        nameTH: "เกลื้อน",
        treat: (key) => (
          <div key={key}>
            <p>
              <strong>สาเหตุ</strong> : เกลื้อนเกิดจากเชื้อรา&nbsp;
              <em>Malassezia&nbsp;furfur</em> &nbsp; โดยปกติราชนิดนี้
              พบได้ตามผิวหนังปกติ
              แต่หากมีปัจจัยบางอย่างมากระตุ้นอาจทำให้เชื้อราเจริญเติบโตมากเกินไป
              ก็จะกลายเป็นโรคเกลื้อนได้&nbsp; ซึ่งปัจจัยที่ทำให้เกิดโรคเกลื้อน
              ได้แก่ สภาพอากาศที่ร้อนชื้น มีเหงื่อออกมาก ผิวมัน
              สวมใส่เสื้อผ้าที่อับชื้น ไม่ระบายอากาศ เป็นต้น
            </p>
            <p>
              <strong>ลักษณะอาการ</strong> : เป็นวงเล็กๆ ขนาดตั้งแต่ 1มม.&nbsp;
              รอบ ๆ รูขุมขนจนถึงรวมกันเป็นปื้นใหญ่
              มีขุยละเอียดโดยเฉพาะอย่างยิ่งเมื่อใช้เล็บขูดเบาๆ จะมีขุยเล็ก ๆ
              สีขาวฟูขึ้นมา ผื่นนี้จะพบสีได้ต่างๆ กัน เช่น อาจเป็นวงสีขาว สีชมพู
              สีเทา จนถึงสีน้ำตาล
            </p>
            <p>
              <strong>อาการร่วม</strong> : อาจมีอาการคันได้เวลาเหงื่อออก
            </p>
            <p>
              <strong>บริเวณที่พบบ่อย</strong> :
              พบได้บ่อยในบริเวณผิวหนังที่มีต่อมไขมันมาก เช่น หน้า ต้นคอ หน้าอก
              หลัง
            </p>
            <p>
              <strong>การดูแลรักษา</strong> :
            </p>
            <ol>
              <li>
                ยาน้ำทา เช่น 20% sodium thiosulfate หรือ 2.5% selenium sulfide
                lotion หรือ แชมพูที่มีส่วนประกอบของketoconazole
                ให้ทายาที่ผื่นทิ้งไว้ 5-10 นาทีแล้วล้างออก
                ยานี้ถ้าทาหรือฟอกมากเกินไป อาจเกิดการระคายเคืองที่ผิวหนังได้
              </li>
              <li>
                ยารับประทาน ใช้ในกรณีที่มีผื่นจำนวนมาก หรือทายาแล้วไม่ได้ผล
                ควรใช้ยาภายใต้คำแนะนำของแพทย์
                เนื่องจากยารับประทานอาจก่อให้เกิดผลข้างเคียงได้
              </li>
              <li>
                รักษาสุขอนามัยส่วนบุคคล เช่น เสื้อผ้า ผ้าเช็ดตัว
                ควรจะซักและนำออกผึ่งแดดให้แห้งก่อนนำมาใช้และไม่ควรใช้ร่วมกับผู้อื่น
                อาบน้ำ ชำระร่างกายให้สะอาดอยู่เสมอ อย่าปล่อยให้เหงื่อไคลหมักหมม
              </li>
            </ol>
          </div>
        ),
      },
      {
        disease: "ringworm",
        nameEN: "Ring worm",
        nameTH: "กลาก",
        treat: (key) => (
          <div key={key}>
            <p>
              <strong>สาเหตุ</strong> : เชื้อรากลุ่ม Dermatophyte
              ซึ่งจะก่อโรคในส่วนของผิวหนังที่สร้างเคอราติน (keratin) เท่าน้ัน
              ฉะนั้นจะเกิดโรคได้ที่ผิวหนังชั้นขี้ไคล (stratum corneum)
              ซึ่งจะมาจากหลายสาเหตุ เช่น
            </p>
            <ol>
              <li>ใช้สิ่งของเครื่องใช้หรือเสื้อผ้าร่วมกับผู้ที่เป็นโรคกลาก</li>
              <li>
                การใช้เครื่องนุ่งห่มที่ไม่เหมาะสม เช่น
                ใส่กางเกงในรัดเเน่นจนเกินไปทำให้เกิดการอับชื้น
              </li>
            </ol>
            <p>
              <strong>ลักษณะอาการ&nbsp;</strong>: ผื่นราบ ที่มีอาการคัน
              วงมีขอบชัดเจน ตรงกลางเรียบ
              ตรงขอบมีตุ่มเเดงหรือตุ่มใสร่วมกับขุยมีรูปร่างเป็นวงกลม วงเเหวน
              หรือหลายวงมารวมกันมีประวัติการใช้ของใช้เช่น เสื้อผ้า ผ้าขนหนู
              ร่วมกับผู้ที่มีอาการลักษณะดังกล่าว
            </p>
            <p>
              <strong>อาการร่วม</strong> : หากมีการเกาบริเวณรอบโรค
              อาจทำให้เกิดการอักเสบเกิดเป็นตุ่มหนองร่วมด้วย
            </p>
            <p>
              <strong>บริเวณที่พบบ่อย</strong> : จะเกิดได้ทั่วไปตั้งแต่หน้า
              (Tinea faciei) ลําตัว (Tinea corporis) ขาหนีบ (Tinea cruris) มือ
              (Tinea manuum) เท้า (Tinea pedis)
            </p>
            <p>
              <strong>การดูแลรักษา</strong> :
            </p>
            <ol>
              <li>
                <strong>ยาทาเฉพาะที่การรักษายากลุ่ม</strong> Imidazole เช่น
                Clotrimazole, Ketoconazole ,Bifonazole, Micronazole, Isoconazole
                เป็นต้น ส่วนใหญ่ในรูปแบบยาครีม ทาบาง ๆ วันละ 1-2
                ครั้งหรือตามแพทย์สั่ง
                <ul>
                  <li>
                    Tolnaftate เป็นยาที่ได้ผลดีกับโรคกลาก มีการใช้กันมานานแล้ว
                    แต่ไม่ได้ผลต่อเกลื้อน และเชื้อรา แคนดิด้าTerbinafine cream
                    ในการทายารักษากลากควรทาให้กว้างกว่ารอยโรคที่ปรากฏสัก 3-4 ซม.
                    เพราะในบริเวณดังกล่าว เป็นบริเวณที่พบเชื้อราแล้ว
                    แต่ยังไม่ปรากฏรอยโรค ส่วนในเรื่องของระยะเวลาในการใช้ยานั้น
                    ถึงแม้ว่าทายา ไปเพียงไม่กี่วัน
                    อาการของกลากหรือฮ่องกงฟุตจะดีขึ้นแล้วก็ตาม
                    แต่เชื้อราอาจยังไม่ตายหมดก็ได้ จึงควร
                    แนะนำให้ทายาต่อไปอีกสัก 15-30 วัน
                    รวมระยะเวลาในการรักษาประมาณ 1 เดือนเป็นอย่างน้อย จึงจะ
                    ได้ผลดี แต่สำหรับฝ่ามือและฝ่าเท้า
                    อาจต้องใช้ยาทาติดต่อกันนานถึง 6-8 สัปดาห์&nbsp;
                  </li>
                </ul>
              </li>
            </ol>
            <ol start="2">
              <li>
                <strong>ยารับประทาน</strong> จะใช้ในกรณีต่อไปนี้ คือ
                โรคเชื้อราที่เป็นบริเวณกว้างหรือเรื้อรัง ,
                โรคเชื้อราที่หนังศีรษะ, &nbsp;โรคเชื้อราที่เล็บ
                <ul>
                  <li>
                    Imidazoles ชนิดรับประทาน อาจแนะนำให้ใช้ยา Ketoconazole
                    ชนิดเม็ด 200 มก. วันละ 1 เม็ด 2- 3 สัปดาห์ หรือ Fluconazole
                    50-100 มก./วัน หรือ Itraconazole 200-400 มก./วัน
                    เป็นระยะเวลาติดต่อกัน 5 วัน
                  </li>
                  <li>
                    Griseofulvin 500 มก./วัน เป็นยาเม็ดที่ได้ผลดีเฉพาะกลาก
                    และควรรับประทานหลังอาหารทันที เพราะอาหารที่มีไขมันสูง
                    จะช่วยในการดูดซึมของยานี้ดียิ่งขึ้น
                    แต่ในปัจจุบันไม่ค่อยนิยมใช้ เพราะยากลุ่ม Imidazoles
                    ให้ผลการรักษาที่ดีกว่า
                  </li>
                  <li>
                    Terbinafine ในรายที่ใช้ยาเม็ดครบตามกำหนดแล้ว
                    แต่รอยโรคอาจยังไม่หายดีก็เป็นได้ แต่รอยโรคจะค่อยๆ ดีขึ้น
                    หลังหยุดยา ทั้งนี้เพราะว่ายายังคงสะสมอยู่หลังจากหยุดยาแล้ว
                    และยายังคงอยู่เพื่อออกฤทธิ์ทำลายเชื้อรา ต่อไปจนหายดี
                    ในรายที่ใช้ยามาเป็นระยะเวลา 6 เดือน
                    จะอาจพบยาอยู่ในร่างกายและออกฤทธิ์อยู่ ตลอดเวลาเป็นปีได้
                  </li>
                  <li>
                    คำแนะนำและข้อควรปฏิบัติในการป้องกันและรักษาโรคกลาก
                    ควรระวังการอับชื้น โดยเฉพาะบริเวณซอกต่างๆ ของร่างกาย เช่น
                    ซอกนิ้วเท้า ซอกขาหนีบ เป็น ต้น ด้วยการเช็ดให้แห้งสนิท
                    ก่อนสวมเครื่องนุ่งห่ม
                  </li>
                  <li>
                    ควรเลือกเครื่องนุ่งห่ม ตั้งแต่ เสื้อ กางเกง ชุดชั้นใน
                    รองเท้า ฯลฯ ให้เหมาะสมกับอุณหภูมิ สภาวะอากาศ
                    และควรให้อากาศถ่ายเทได้ง่าย โดยเฉพาะในฤดูร้อน หรือ
                    ผู้ที่ทำงานกลางแจ้ง
                  </li>
                  <li>
                    ในรายที่มีเหงื่อออกเป็นจำนวนมาก อาจใช้ยากลุ่ม Aluminium
                    Chloride 6.5-20% เพื่อช่วยใน การระงับเหงื่อ
                  </li>
                  <li>
                    ในรายที่เป็นกลากที่ศีรษะบ่อยๆ เมื่อหายดีแล้วอาจใช้แชมพู
                    Selenium sulfide หรือ Ketoconazole สัปดาห์ละครั้ง
                    เพื่อช่วยป้องกันการกลับมาเป็นซ้ำ
                  </li>
                </ul>
              </li>
            </ol>
          </div>
        ),
      },
      {
        disease: "warts",
        nameEN: "Wart",
        nameTH: "หูด",
        treat: (key) => (
          <div key={key}>
            <p>
              <strong>สาเหตุ</strong> : การติดเชื้อ HPV
              เกิดจากการสัมผัสโดยตรงจากผิวหนังคนที่เป็นหูด
              หรือสัมผัสทางอ้อมผ่านทางสิ่งของที่ปนเปื้อนเชื้อ เช่น
              สถานที่ออกกำลังกายสาธารณะ รอยถลอก ผิวหนังที่เปื่อยยุ่ย หรือฉีกขาด
              หรือการติดเชื้อที่ผิวหนังผิวหนัง
              จะทำให้เชื้อเข้าสู่เซลล์ผิวหนังได้ง่าย
            </p>
            <p>
              <strong>ลักษณะอาการ</strong> :
            </p>
            <ol>
              <li>
                หูดผิวหนัง (verruca vulgaris หรือ common wart)
                ลักษณะเป็นตุ่มนูนแข็ง ผิวหน้าขรุขระ สีผิวหนังหรือสีดำ ขนาด 2-3
                มิลลิเมตร ถึงหลายเซนติเมตร อยู่เดี่ยว ๆ
                หรือเป็นกลุ่มพบได้ทุกตําแหน่งบนผิวหนัง มักพบบ่อยบริเวณมือ
                นิ้วมือ เข่า ศอก
              </li>
              <li>
                หูดที่ฝ่าเท้า (plantar wart)
                ลักษณะเป็นตุ่มแข็งฝังลึกอยู่ในฝ่าเท้า มักจะเจ็บเมื่อมีการกดทับ
                ถ้ามีหูดหลายอันมารวมกันเหมือน เศษกระเบื้องมาเรียงต่อกันเรียกว่า
                mosaic wart
                <br /> อาการร่วม : ไม่พบอาการร่วมเจ็บปวดหรือคัน
              </li>
            </ol>
            <p>
              <strong>บริเวณที่พบบ่อย</strong> : ผิวหนัง ฝ่ามือ และฝ่าเท้า
            </p>
            <p>
              <strong>การดูแลรักษา</strong> : การใช้กรดซาลิไซลิก (salicylic
              acid) แนะนำใช้เป็นยาตัวแรกในการรักษาหูดที่หน้า มือ และฝ่าเท้า
              ข้อดีของการใช้กรดซาลิซิลิก คือ หาซื้อง่าย ไม่แพง ไม่เจ็บ
              และมีประสิทธิภาพ
              ข้อเสียคือต้องใช้เวลารักษานานเป็นสัปดาห์หรือเป็นเดือน
              และผู้ป่วยจะต้องทำตามคำแนะนำ
            </p>
          </div>
        ),
      },
      {
        disease: "psoriasis",
        nameEN: "Psoriasis",
        nameTH: "สะเก็ดเงิน",
        treat: (key) => (
          <div key={key}>
            <p>
              <strong>สาเหตุ</strong> :
              ความผิดปกติของภูมิคุ้มกันความผิดปกติทางพันธุกรรม
              สามารถส่งผ่านพ่อแม่มาสู่ลูกได้ หรือผู้ใกล้ชิดทางสายเลือด
              ภาวะอารมณ์โดยเฉพาะความเครียด อารมณ์โกรธ วิตกกังวล
              จะทำให้ภูมิคุ้มกันของร่างกายต่ำลง จนส่งผลให้เซลล์เกิดความผิดปกติ
              และระดับฮอร์โมนที่เปลี่ยนแปลง เช่น ภาวะหมดประจำเดือนการตั้งครรภ์
            </p>
            <p>
              <strong>ลักษณะอาการ&nbsp;</strong>: ผื่นสีแดงค่อนข้างหนา,
              มีขุยสีขาวคล้ายรังแคติดที่ผิวแต่มักจะรุนแรงกว่า
              มีสะเก็ดออกมามากกว่าและกระจายอยู่ตามส่วนต่าง ๆ ของร่างกาย
              คันไม่มีการติดเชื้อและไม่แพร่เชื้อ
            </p>
            <p>
              <strong>อาการร่วม</strong> : ข้ออักเสบ , อ่อนเพลีย , หนาวสะท้าน,
              ไข้ , ปวดแสบบริเวณที่มีผื่น , ความอยากอาหารลดลง
            </p>
            <p>
              <strong>บริเวณที่พบบ่อย</strong> : ศอกและเข่า
              หรือตำแหน่งที่มีการเกาหรือเสียดสี เช่นสะโพก ฝ่ามือ ฝ่าเท้า
            </p>
            <p>
              <strong>การดูแลรักษา&nbsp;</strong>:
            </p>
            <ol>
              <li>
                ยาทาคอติโคสเตียรอยด์ (topicalcorticosteroids) ,น้ำมันดิน(tar),
                แอนทราลิน (anthralin,dithranol) , อนุพันธ์วิตามินดี
                (calipotriol) , calcineurin inhibitor (tacrolimus, pimecrolimus)
                , Salicylic Acid
              </li>
              <li>
                ยารับประทาน :&nbsp; เมทโทเทรกเสท (methotrexate) , acitretin ,
                cyclosporin
              </li>
            </ol>
          </div>
        ),
      },
      {
        disease: "impetigo",
        nameEN: "Impetigo",
        nameTH: "แผลพุพอง",
        treat: (key) => (
          <div key={key}>
            <p>
              <strong>สาเหตุ</strong> : จากการติดเชื้อแบคทีเรียสแตฟิโลค็อกคัส
              ออเรียส (Staphylococcus Aureus) หรือเชื้อแบคทีเรียสเตรปโตคอดคัส
              พัยโอจีเนส (Streptococcus Pyogenes)
              เข้าสู่ร่างกายผ่านทางผิวหนังเมื่อมีการระคายเคือง มีบาดแผล
              โดนของมีคมบาด แมลงกัด ได้รับบาดเจ็บ หรือมีปัญหาผิวอื่น ๆ เช่น กลาก
              และจากการสัมผัสกับผู้ที่ติดเชื้อหรือใช้ของใช้ร่วมกัน เช่น ผ้าขนหนู
              แก้วน้ำ หรือของเล่น ปัจจัยเสี่ยงมนการติดเชื้อ ได้แก่
              อาศัยอยู่ในเขตร้อนชื้น
            </p>
            <p>
              <strong>ลักษณะอาการ</strong> : แบ่งได้เป็น 2 ลักษณะ คือ
            </p>
            <ol>
              <li>
                แผลพุพองแบบมีตุ่มน้ำ (Bullous Impetigo)มีตุ่มน้ำพองใสขนาด 1-2
                เซนติเมตรพบบริเวณลำตัวจนถึงลำคอ หรือที่แขนและขาทั้ง 2
                ข้างจะแตกออกและกลายเป็นสะเก็ดสีเหลือง เจ็บและคันบริเวณรอบๆ
              </li>
              <li>
                แผลพุพองแบบไม่มีตุ่มน้ำ (Non-Bullous Impetigo) :
                มีตุ่มหรือผื่นแดง ขนาดประมาณ 2 เซนติเมตรและกลายเป็นแผล
                พบที่รอบจมูกและปาก อาจขึ้นที่ส่วนอื่นของใบหน้า หรือแขนและขาได้
                ไม่รู้สึกเจ็บที่บริเวณแผลแต่จะมีอาการคัน
                แผลอาจกระจายเป็นบริเวณกว้างทิ้งสะเก็ดหนาสีเหลือง
                หลังจากสะเก็ดหลุดแล้วจะทิ้งรอยแดง
              </li>
            </ol>
            <p>
              <strong>อาการร่วม</strong> : เกิดร่วมกับผื่นผิวหนังชนิดอื่น เช่น
              โรคภูมิแพ้ผิวหนังอักเสบ
            </p>
            <p>
              <strong>บริเวณที่พบบ่อย</strong> : บริเวณใบหน้า รอบจมูก ปาก
              มือและเท้า สามารถกระจายไปยังส่วนอื่น ๆ ของร่างกาย
            </p>
            <p>
              <strong>การดูแลรักษา</strong> :
            </p>
            <ol>
              <li>
                ทำความสะอาดแผลบริเวณที่มีการติดเชื้อให้สะอาด
                ไม่ควรขัดที่บริเวณแผล ,
                หลีกเลี่ยงการสัมผัสผิวหนังบริเวณที่มีแผลพุพอง
                ไม่ควรเกาเพื่อลดการแพร่กระจาย
                และล้างมือให้สะอาดทุกครั้งหลังสัมผัสโดนผิวหนังบริเวณที่มีแผลพุพอง
              </li>
              <li>
                ยา : Tetracycline, Garamycin cream, Fucidin cream , Bactroban ,
                Gentian violet, Penicillin V , Cloxacillin, Dicloxacillin,
                mupirocin, Erythromycin, Co-amoxiclav, fusidic acid, Cephalexin,
                Cefaclor
              </li>
            </ol>
          </div>
        ),
      },
      {
        disease: "herpessimplex",
        nameEN: "Herpes",
        nameTH: "เริม",
        treat: (key) => (
          <div key={key}>
            <p>
              <strong>สาเหตุ</strong> : เริมที่อวัยะเพศ มีสาเหตุมาจากเชื้อไวรัส
              HSV (Herpes Simplex Virus)
              โดยเชื้อไวรัสตัวนี้จะติดต่อและมักแสดงอาการที่บริเวณอวัยวะเพศ
              ปากมดลูก
              หรืออาจแสดงอาการบนผิวหนังบริเวณอื่นของร่างกายได้จากการมีเพศสัมพันธ์ทางช่องคลอด
              หรือทางทวารหนักโดยไม่มีการป้องกันการใช้ปากในการมีเพศสัมพันธ์กับผู้ที่มีเม็ดตุ่มใสที่ปากการใช้อุปกรณ์
              เพื่อกิจกรรมทางเพศร่วมกันทำการสัมผัสอวัยวะเพศกับผู้ที่ติดเชื้อโรคเริม
            </p>
            <p>
              <strong>ลักษณะอาการ&nbsp;</strong>:
            </p>
            <ol>
              <li>
                เริมที่อวัยวะเพศ จะมีลักษณะเป็นตุ่มแผลที่อวัยวะเพศ
                และมีอาการเจ็บแสบบริเวณรอบๆ
                อวัยวะเพศก่อนที่จะปรากฏตุ่มแผลพุพองขึ้นมา โดยมีอาการปวดศีรษะ
                รวมถึงเป็นไข้ ปวดเมื่อยกล้ามเนื้อก่อน แล้วจึงจะเกิดตุ่มใสๆ
                รวมถึงมีอาการเจ็บปวดมากขึ้น
                โรคเริมที่อวัยวะเพศแสดงอาการครั้งแรกนานประมาณ 4 ถึง 7 วัน
              </li>
              <li>
                เริมที่ปาก เริ่มด้วยอาการปวดแสบปวดร้อน คันๆบริเวณปากก่อนเกิดผื่น
                2 วัน ต่อมาเกิดตุ่มใสที่ปากหรือริมฝีปาก
                ตุ่มอาจจะรวมกันเป็นแผลใหญ่ อาจจะมีไข้ต่ำๆ
              </li>
            </ol>
            <p>
              <strong>อาการร่วม&nbsp;</strong>: อาจมีอาการเจ็บ ปวดแสบปวดร้อน
              หรืออาจจะมีไข้ได้
            </p>
            <p>
              <strong>บริเวณที่พบบ่อย</strong> : ปากและอวัยวะเพศ
            </p>
            <p>
              <strong>การดูแลรักษา</strong> :
            </p>
            <ol>
              <li>
                <strong>การดูแลตนเอง</strong> พักผ่อนให้เพียงพอรักษาสุขอนามัย
                ป้องกันการติดเชื้อในเนื้อเยื่อ และอวัยวะและสู่ผู้อื่น
                <ul>
                  <li>
                    แยกของใช้ เครื่องใช้ ส่วนตัว
                    รวมทั้งแก้วน้ำและช้อนเพื่อป้องกันการติดเชื้อดื่มน้ำสะอาดมากๆ
                    อย่างน้อย 6 &ndash; 8 แก้วต่อวัน
                  </li>
                  <li>
                    รักษาความสะอาดบริเวณตุ่มพอง และเครื่องใช้ต่างๆ
                    รวมถึงไม่ใช้ของใช้ส่วนตัวร่วมกัน
                  </li>
                  <li>
                    ตัดเล็บให้สั้น ป้องกันการเกาและตุ่มน้ำติดเชื้อจากการเกา
                  </li>
                  <li>
                    ในรายที่เกิดโรคบริเวณอวัยวะเพศ ควรสวมใส่เสื้อผ้า
                    กางเกงในที่หลวมสบาย และหลีกเลี่ยงการมีเพศสัมพันธ์ช่วงนั้น
                  </li>
                </ul>
              </li>
              <li>
                <strong>ยาที่ใช้ในการรักษาโรคเริม</strong>{" "}
                เมื่อเป็นโรคเริมครั้งแรก บางคนอาจต้องใช้ยาเพื่อช่วยในการรักษา
                มียา 2 กลุ่มที่สามารถใช้รักษาโรคเริมได้ ประกอบด้วย
                <ul>
                  <li>
                    ยาต้านไวรัส :
                    ยานี้มีทั้งยาในรูปแบบรับประทานและครีมทาที่ผิวหนัง
                    ซึ่งยาต้านไวรัสที่มักใช้รักษาโรคเริม ได้แก่Zovirax
                    (acyclovir), Famvir (famciclovir), Valtrex (valacyclovir),
                    Abreva (docosanol)
                  </li>
                  <li>
                    ยาแก้ปวด : ยากลุ่มนี้ช่วยบรรเทาอาการปวดที่เกิดจากเริม
                    แต่ไม่ได้รักษาที่การติดเชื้อไวรัสยาแก้ปวดในรูปแบบรับประทาน
                    ได้แก่ Aspirin, Tylenol (acetaminophen), Advil หรือ Motrin
                    (ibuprofen)
                  </li>
                </ul>
              </li>
            </ol>
          </div>
        ),
      },
      {
        disease: "chickenpox",
        nameEN: "Chickenpox",
        nameTH: "อีสุกอีใส",
        treat: (key) => (
          <div key={key}>
            <p>
              <strong>สาเหตุ</strong> :&nbsp; เกิดจากการติดเชื้อ Varicella
              zoster virus (VZV)
              เป็นครั้งแรกซึ่งพบได้ทั่วโลกโดยการแพร่เชื้อผ่านระบบทางเดินหายใจเป็นหลัก
              (Respiratory tract)
              แต่ก็สามารถติดต่อผ่านทางสัมผัสผิวหนังที่ติดเชื้อโดยตรง (Direct
              Contact)
            </p>
            <p>
              <strong>ลักษณะอาการ</strong> :
            </p>
            <ol>
              <li>
                ระยะฟักตัวของโรคประมาณ 2 สัปดาห์อาการแสดงนำผู้ป่วยจะมีไข้สูง
                ปวดเมื่อยกล้ามเนื้อปวดศีรษะเบื่ออาหาร 2-3 วันก่อนผื่นขึ้น
                โดยอาการนำจะพบได้บ่อยในผู้ใหญ่ในผู้ป่วยที่ไม่เคยได้รับวัคซีนผื่นจะเริ่มขึ้นที่บริเวณใบหน้าและศีรษะตามมาที่ลำตัวส่วนแขนขาลักษณะผื่นเริ่มแรกเป็นตุ่มแดง
                Erythematous macules papules ต่อมากลายเป็นตุ่มน้ำ (Vesicles หนอง
                (Pustules) และตกสะเก็ด (Crusts)รวดเร็วภายใน 12 ชั่วโมง
              </li>
              <li>
                ลักษณะตุ่มน้ำจะมีขนาดตุ่มน้ำประมาณ 2-3 มม.
                และเป็นรูปวงรีขนานกับรอยพับผิวหนัง
                และอยู่บนฐานสีแดงคล้ายหยดน้ำบนกลีบกุหลาบเรียกลักษณะนี้ว่า
                Dewdrop on rose petal
                อาการไข้สูงจะยังคงอยู่ตลอดเวลาที่ยังมีผื่นตุ่มน้ำใหม่ขึ้นอยู่
                อาการคันมักพบในช่วงตื่นตุ่มน้ำใส พื้นที่แห้งเป็นสะเก็ด (Crusted
                lesions) มักแห้งและหลุดไปภายใน 1-3
                สัปดาห์เหลือเป็นแผลเป็นหลุมซึ่งจะค่อย ๆ
                จางหายไปในเวลาเป็นเดือนถ้าผู้ป่วยมีการแกะเกาหรือติดเชื้อแบคทีเรียซ้ำจะพบแผลเป็นชนิดถาวร
              </li>
            </ol>
            <p>
              <strong>อาการร่วม</strong> : มีไข้สูง
            </p>
            <p>
              <strong>บริเวณที่พบบ่อย</strong> : ใบหน้าและลำตัว
              และค่อยๆลามไปยังแขนขา
            </p>
            <p>
              <strong>การดูแลรักษา</strong> :
            </p>
            <ol>
              <li>
                ยาต้านไวรัส เช่น acy-clovir
                ในผู้ป่วยเด็กที่มีโรคเรื้อรังและผู้ป่วยที่เป็นผู้ใหญ่เนื่องจากมีแนวโน้มจะเกิดอาการและภาวะแทรกซ้อนที่รุนแรงเพื่อให้ได้ผลดีควรให้รับประทานยาภายใน
                24 &ndash; 48 ชั่วโมง หลังมีผื่นขึ้น
              </li>
              <li>
                รับประทานยาแก้แพ้และ ทายาคาลามายด์ (calamine lotion)
                เพื่อลดอาการคัน
              </li>
              <li>
                การดูแลตนเอง โดย ควรอาบน้ำและใช้สบู่ฟอกผิวหนังให้สะอาด&nbsp;
                ตัดเล็บให้สั้นและหลีกเลี่ยงการแกะเกา ควรพักผ่อนและดื่มน้ำมากๆ
                ถ้ามีไข้สูง ควรใช้ผ้าชุบน้าเช็ดตัวบ่อย ๆ และ
                รับประทานยาพาราเซตามอลบรรเทาไข้
                <ul>
                  <li>
                    หลีกเลี่ยงการรับประทานยาลดไข้กลุ่ม แอสไพริน
                    เพราะอาจก่อให้เกิด Reye&rsquo;s syndrome
                    ซึ่งมีอาการสมองและตับอักเสบรุนแรง
                  </li>
                  <li>
                    ถ้ามีอาการคัน ให้รับประทานยาแก้แพ้และ ทายาคาลามายด์
                    (calamine lotion)
                  </li>
                  <li>ใช้น้าเกลือกลั้วปาก หากมีอาการปากเปื่อย ลิ้น เปื่อย</li>
                </ul>
              </li>
            </ol>
          </div>
        ),
      },
      {
        disease: "scabies",
        nameEN: "Scabie",
        nameTH: "หิด",
        treat: (key) => (
          <div key={key}>
            <p>
              <strong>สาเหตุ</strong> :
              โรคหิดเกิดจากไรตัวเมียซึ่งมีช่วงชีวิตอยู่ในผิวหนังชั้นหนังกำพร้าของมนุษย์ได้มากกว่า30วัน
              โรคนี้ติดต่อได้ด้วยการสัมผัสกับผู้ป่วยอย่างใกล้ชิด
            </p>
            <p>
              <strong>ลักษณะอาการ</strong> :
              ผื่นของหิดจะคันมากเกิดหลังติดเชื้อประมาณ 2
              สัปดาห์โดยเฉพาะเวลากลางคืนผื่นมีลักษณะเป็นตุ่มน้ำใสหรือตุ่มแดงคัน
              ผื่นจะกระจายไปทั่วตัว ผื่นของหิดชนิดหนึ่งอาจพบเป็นตุ่มนูนเนื้อ
              สีแดงอมน้ำตาล คัน มักพบตุ่มชนิดนี้บริเวณรักแร้และอวัยวะเพศ
              มักไม่พบตัวหิดในผื่นชนิดนี้และหลังการรักษาหิดหายแล้วผื่นนี้จะยังคงอยู่ได้
            </p>
            <p>
              <strong>อาการร่วม</strong> : คันเวลากลางคืน
            </p>
            <p>
              <strong>บริเวณที่พบบ่อย</strong> : ง่ามมือง่ามเท้า ข้อพบแขน รักแร้
              เต้านม อวัยวะเพศ รอบสะดือ และก้น ในเด็กอาจพบผื่นบริเวณหน้าและศีรษะ
            </p>
            <p>
              <strong>การดูแลรักษา&nbsp;</strong>: ยาทา
            </p>
            <ol>
              <li>
                Sulfa 5-10 % ทายาทั่วร่างกายตั้งแต่หนังศีรษะจรดฝ่าเท้าทิ้งไว้นาน
                24 ชั่วโมง อาบน้ำแล้วทายาซ้ำทำเช่นนี้ติดต่อกัน 3 วัน และทาซ้ำใน
                1 สัปดาห์ถัดมา รวมเป็นทายา 4 ครั้ง
              </li>
              <li>
                Benzyl benzoate 12.5-25% ทายาตั้งแต่คอถึงเท้า ทิ้งยาไว้นาน 24
                ชั่วโมงอาบน้ำแล้วทายาซ้ำติดต่อกัน 3 วัน และทาซ้ำ1 สัปดาห์ต่อมา
              </li>
              <li>
                ยารับประทาน: Ivermectin ข้อบ่งชี้ในการใช้ยานี้คือ
                ผู้ป่วยที่ดื้อต่อการรักษาด้วยยาชนิดอื่นๆแล้ว
                หรือผู้ป่วยที่ภูมิคุ้มกันบกพร่อง
                หรือผู้ป่วยที่ไม่สามารถทายารักษาโรคหิดทั่วร่างกาย
              </li>
            </ol>
          </div>
        ),
      },
      {
        disease: "urticaria",
        nameEN: "Urticaria",
        nameTH: "ลมพิษ",
        treat: (key) => (
          <div key={key}>
            <p>
              <strong>สาเหตุ</strong> : มีหลายสาเหตุด้วยกัน ดังนี้
            </p>
            <ol>
              <li>อาหาร เช่น อาหารทะเล สารกันบูด สีผสมอาหารบางชนิด</li>
              <li>ยา ปฏิกิริยาการแพ้ยาบางชนิดอาจทำให้ เกิดผื่นลมพิษได้</li>
              <li>
                การติดเชื้อการติดเชื้อไวรัส แบคทีเรีย เชื้อรา
                หรือมีพยาธิเป็นสาเหตุของลมพิษได้ทั้งสิ้น
              </li>
              <li>โรคระบบต่อมไร้ท่อเช่น โรคต่อมไทรอยด์</li>
              <li>
                อิทธิพลทางกายภาพ ผู้ป่วยบางราย
                ผื่นลมพิษอาจเป็นผลจากปฏิกิริยาของผิวหนังที่ตอบสนองผิดปกติต่อความร้อน
                ความเย็น น้ำหนักกดรัด แสงแดด การออกกําลังกายเป็นต้น
              </li>
              <li>
                การแพ้สารที่สัมผัส
                ผื่นลมพิษเกิดขึ้นในตําแหน่งที่ผิวหนังสัมผัสกับสารที่แพ้ เช่น
                การแพ้ยา (Iatex) ขนสัตว์ พืช หรืออาหารบางชนิด เป็นต้น
              </li>
              <li>ปฏิกิริยาแพ้พิษแมลง เช่น ปฏิกิริยาที่เกิดจากผึ้ง ต่อต่อย</li>
              <li>มะเร็ง เช่น มะเร็งต่อมน้ำเหลือง หรือระบบอื่น ๆของร่างกาย</li>
              <li>
                ระบบภูมิคุ้มกันต่อต้านตัวเอง
                ผู้ป่วยลมพิษบางรายเกิดจากมีภูมิคุ้มกันไปกระตุ้นให้เกิด
                การหลั่งสารเคมี บางชนิดออกมาที่ผิวหนัง ทําให้เกิดผื่นลมพิษขึ้น
              </li>
              <li>
                สาเหตุอื่นๆเช่น ผู้ป่วยโรคลูปัสหรือ
                ผู้ป่วยโรคเส้นเลือดอักเสบบางรายอาจมีผื่นลมพิษ แต่มีข้อสังเกต
                คือแต่ละผื่นอยู่นานมักเกิน 24 ชั่วโมง เวลาหายมักมีรอยดำ
              </li>
            </ol>
            <p>
              <strong>ลักษณะอาการ</strong> : มักเกิดขึ้นอย่างเฉียบพลัน
              เป็นผื่นลักษณะนูนแดง จะมีขนาดและรูปร่างแตกต่างกันไป
              อาจเกิดขึ้นได้ที่บริเวณใบหน้า แขน ขา ลำตัว รวมไปถึงส่วนอื่น ๆ
              ของร่างกาย
              ผู้ป่วยจะรู้สึกคันมากและหากเกาก็จะเกิดผื่นแดงมากยิ่งขึ้น
            </p>
            <p>
              <strong>อาการร่วม</strong> :
              คันมากและหากเกาก็จะเกิดผื่นแดงมากยิ่งขึ้น
            </p>
            <p>
              <strong>บริเวณทีพบบ่อย</strong> : มักพบได้บริเวณ ใบหน้า ลำตัว
              แขนและขา
            </p>
            <p>
              <strong>การดูแลรักษา</strong> :
            </p>
            <ol>
              <li>
                พยายามหาสาเหตุ และรักษาหรือหลีกเลี่ยงสาเหตุที่ทําให้เกิดโรคลมพิษ
              </li>
              <li>
                ให้ยาต้านฮีสตามีน ยาต้านฮีสตามีนมีหลายชนิด หลายกลุ่ม
                มีทั้งที่ออกฤทธิ์สั้นและ ออกฤทธิ์ยาว
                การจะเลือกใช้ยาต้านฮีนตามีนตัวใดขึ้นอยู่กับดุลยพินิจของ
                แพทย์การตอบสนองต่อยาต้านฮีสตามีนในผู้ป่วยแต่ละรายอาจไม่เหมือนกัน
                ผู้ป่วยบางรายใช้ยา
                เพียงตัวเดียวก็ได้ผลดีแต่บางรายแพทย์อาจต้องเปลี่ยนไปใช้ยาต้านฮีสตามีนในกลุ่มอื่น
                หรือใช้ยา หลายตัวรวมกัน เพื่อควบคุมอาการ
              </li>
              <li>
                ยาอื่นๆในกรณีที่ผู้ป่วยมีอาการมาก
                ผื่นไม่ค่อยตอบสนองต่อยาต้านฮีสตามีน
                แพทย์อาจพิจารณาใช้ยาอื่นที่มีฤทธิ์ยับยั้งการสร้างและหลั่งสารสื่อกลางในผิวหนังที่เป็นตัวการที่ก่อให้เกิดผื่นลมพิษ
              </li>
            </ol>
          </div>
        ),
      },
      {
        disease: "abscess",
        nameEN: "Abscess",
        nameTH: "ฝี",
        treat: (key) => (
          <div key={key}>
            <p>
              <strong>สาเหตุ</strong> :&nbsp; เกิดจากการติดเชื้อ Varicella
              zoster virus (VZV)
              เป็นครั้งแรกซึ่งพบได้ทั่วโลกโดยการแพร่เชื้อผ่านระบบทางเดินหายใจเป็นหลัก
              (Respiratory tract)
              แต่ก็สามารถติดต่อผ่านทางสัมผัสผิวหนังที่ติดเชื้อโดยตรง (Direct
              Contact)
            </p>
            <p>
              <strong>ลักษณะอาการ</strong> :
            </p>
            <ol>
              <li>
                ระยะฟักตัวของโรคประมาณ 2 สัปดาห์อาการแสดงนำผู้ป่วยจะมีไข้สูง
                ปวดเมื่อยกล้ามเนื้อปวดศีรษะเบื่ออาหาร 2-3 วันก่อนผื่นขึ้น
                โดยอาการนำจะพบได้บ่อยในผู้ใหญ่ในผู้ป่วยที่ไม่เคยได้รับวัคซีนผื่นจะเริ่มขึ้นที่บริเวณใบหน้าและศีรษะตามมาที่ลำตัวส่วนแขนขาลักษณะผื่นเริ่มแรกเป็นตุ่มแดง
                Erythematous macules papules ต่อมากลายเป็นตุ่มน้ำ (Vesicles หนอง
                (Pustules) และตกสะเก็ด (Crusts)รวดเร็วภายใน 12 ชั่วโมง
              </li>
              <li>
                ลักษณะตุ่มน้ำจะมีขนาดตุ่มน้ำประมาณ 2-3 มม.
                และเป็นรูปวงรีขนานกับรอยพับผิวหนัง
                และอยู่บนฐานสีแดงคล้ายหยดน้ำบนกลีบกุหลาบเรียกลักษณะนี้ว่า
                Dewdrop on rose petal
                อาการไข้สูงจะยังคงอยู่ตลอดเวลาที่ยังมีผื่นตุ่มน้ำใหม่ขึ้นอยู่
                อาการคันมักพบในช่วงตื่นตุ่มน้ำใส พื้นที่แห้งเป็นสะเก็ด (Crusted
                lesions) มักแห้งและหลุดไปภายใน 1-3
                สัปดาห์เหลือเป็นแผลเป็นหลุมซึ่งจะค่อย ๆ
                จางหายไปในเวลาเป็นเดือนถ้าผู้ป่วยมีการแกะเกาหรือติดเชื้อแบคทีเรียซ้ำจะพบแผลเป็นชนิดถาวร
              </li>
            </ol>
            <p>
              <strong>อาการร่วม</strong> : มีไข้สูง
            </p>
            <p>
              <strong>บริเวณที่พบบ่อย</strong> : ใบหน้าและลำตัว
              และค่อยๆลามไปยังแขนขา
            </p>
            <p>
              <strong>การดูแลรักษา</strong> :
            </p>
            <ol>
              <li>
                ยาต้านไวรัส เช่น acy-clovir
                ในผู้ป่วยเด็กที่มีโรคเรื้อรังและผู้ป่วยที่เป็นผู้ใหญ่เนื่องจากมีแนวโน้มจะเกิดอาการและภาวะแทรกซ้อนที่รุนแรงเพื่อให้ได้ผลดีควรให้รับประทานยาภายใน
                24 &ndash; 48 ชั่วโมง หลังมีผื่นขึ้น
              </li>
              <li>
                รับประทานยาแก้แพ้และ ทายาคาลามายด์ (calamine lotion)
                เพื่อลดอาการคัน
              </li>
              <li>
                การดูแลตนเอง โดย ควรอาบน้ำและใช้สบู่ฟอกผิวหนังให้สะอาด&nbsp;
                ตัดเล็บให้สั้นและหลีกเลี่ยงการแกะเกา ควรพักผ่อนและดื่มน้ำมากๆ
                ถ้ามีไข้สูง ควรใช้ผ้าชุบน้าเช็ดตัวบ่อย ๆ และ
                รับประทานยาพาราเซตามอลบรรเทาไข้
                <ul>
                  <li>
                    หลีกเลี่ยงการรับประทานยาลดไข้กลุ่ม แอสไพริน
                    เพราะอาจก่อให้เกิด Reye&rsquo;s syndrome
                    ซึ่งมีอาการสมองและตับอักเสบรุนแรง
                  </li>
                  <li>
                    ถ้ามีอาการคัน ให้รับประทานยาแก้แพ้และ ทายาคาลามายด์
                    (calamine lotion)
                  </li>
                  <li>ใช้น้าเกลือกลั้วปาก หากมีอาการปากเปื่อย ลิ้น เปื่อย</li>
                </ul>
              </li>
            </ol>
          </div>
        ),
      },
    ];

    const getDisease = localStorage.getItem("disease");
    setDisease(
      (disease) =>
        (disease = data.filter((item) => item.disease === getDisease))
    );
  }, []);

  const [splash, spSplash] = useState(true);
  useEffect(() => {
    setTimeout(() => {
      spSplash(false);
    }, 1500);
  }, []);

  return (
    <div>
      <CustomNavBar route="/picture" title="ผลการวินิจฉัยโรค" />
      {splash ? (
        <div className="loader-container center">
          <div className="result-loader"></div>
          <p>กำลังวินิจฉัยโรค...</p>
        </div>
      ) : (
        <WingBlank size="lg" className="fade-in">
          <WhiteSpace size="lg" />
          <Card className="custom-card-result">
            <Card.Body>
              <div className="deseace-name">
                {disease !== "" &&
                  disease.map((item, i) => (
                    <div key={i}>{item.nameTH + " (" + item.nameEN + ")"}</div>
                  ))}
              </div>
            </Card.Body>
          </Card>
          <WhiteSpace size="lg" />
          <Card className="custom-card-result">
            <Card.Header title="การรักษาและการดูแลเบื้องต้น" />
            <WingBlank size="lg">
              <Card.Body className="card-content-result">
                <div className="ward-content">
                  {disease !== "" &&
                    disease.map((item, key) => item.treat(key))}
                </div>
              </Card.Body>
              <WhiteSpace size="lg" />
            </WingBlank>
          </Card>
          <WhiteSpace size="lg" />
          <Button className="result-button" onClick={goHome}>
            <CustomIcon name="home-icon" size="20" inline />
            <div style={{ display: "inline", marginLeft: "1rem" }}>
              กลับสู่หน้าหลัก
            </div>
          </Button>
          <WhiteSpace size="lg" />
        </WingBlank>
      )}
    </div>
  );
}
